[
    {
        "text": "Напишите код так, как сопровождать его будет склонный к насилию психопат, который знает, где вы живете",
        "author": "Стив Макконнелл"
    },
    {
        "text": "Сложность программы развивается до тех пор, пока не превысит способности программиста",
        "author": "Артур Блох. Законы Мэрфи"
    },
    {
        "text": "Программирование сегодня — это гонка программ, стремящихся писать программы с большей и лучшей идиотоустойчивостью, и возникновение, которое создает больше отбора идиотов. Пока вселенная рождает.",
        "author": "Рик Кук"
    },
    {
        "text": "Ходить по воде и продуктам программы, следуя ТЗ, очень просто… если они заморожены",
        "author": "И. Берард"
    },
    {
        "text": "Программирование на быстрых танцах на только что отполированных полулюдях с использованием бритв в руках.",
        "author": "Валди Рэйвенс"
    },
    {
        "text": "Не волнуйтесь, если что-то не работает. Если бы всё Работало, вас бы уволили.",
        "author": "Закон Мошера в программной инженерии"
    },
    {
        "text": "Чтобы написать чистый код, мы сначала напишем грязный код, а затем рефакторим его.",
        "author": "Роберт Мартин"
    },
    {
        "text": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода.",
        "author": "Кристофер Томпсон"
    },
    {
        "text": "Мы чувствуем себя обществом, которое все больше зависит от машин, но при этом использует их все неэффективнее.",
        "author": "Дуглас Рашкофф"
    },
    {
        "text": "Программирование — это разбиение чего-то большого и невозможного на что-то маленькое и вполне реальное.",
        "author": "Джазвант"
    },
    {
        "text": "Работает? Не трогай.",
        "author": "Любой программист"
    },
    {
        "text": "Люди думают, что безопасность — это существительное, что-то, что можно купить. На самом же деле безопасность — это абстрактное предложение, как счастье.",
        "author": "Джеймс Гослинг"
    },
    {
        "text": " Думаю, это новая фичей. Только не будет говорить ни о ком, что она случайно оказалась.",
        "author": "Ларри Уолл"
    },
    {
        "text": "Лень — главное достоинство программиста.",
        "author": "Ларри Уолл"
    },
    {
        "text": "Легче изобрести будущее, чем предсказать его.",
        "author": "Алан Кей"
    },
    {
        "text": "Магия перестает существовать после того, как вы понимаете, как она работает.",
        "author": "Тим Бернерс-Ли"
    },
    {
        "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку составлено по его весу.",
        "author": "Билл Гейтс"
    }
]